// img section problems
import iconRelationship from '../images/icon-relationship.svg';
import iconDepression from '../images/icon-depression.svg';
import iconLaziness from '../images/icon-laziness.svg';
import iconPanic from '../images/icon-panic.svg';
import iconPhobia from '../images/icon-phobia.svg';
import iconSelfEsteem from '../images/icon-self-esteem.svg';
import iconGrief from '../images/icon-grief.svg';
import iconDesease from '../images/icon-desease.svg';
import iconLossControl from '../images/icon-loss-control.svg';
import iconSenselessness from '../images/icon-senselessness.svg';
import iconSelfRealization from '../images/icon-self-realization.svg';
import iconDependencies from '../images/icon-dependencies.svg';

export const problems = [
  {
    title: 'Отношения с окружающими',
    text: 'Непонимание и неудовлетворенность в личных отношениях с партнером или супругом, барьеры и неудачи в общении с противоположным полом, переживание по поводу расставания или развода, конфликты на работе, трудности во взаимоотношениях с родителями и т.д.',
    img: iconRelationship
  },
  {
    title: 'Депрессия и апатия',
    text: 'Подавленное настроение, потеря интереса к происходящему вокруг, отсутствие каких бы то ни было желаний, ожидание того, что в будущем будет только хуже',
    img: iconDepression
  },
  {
    title: 'Лень и прокрастинация',
    text: 'Трудности с самомотиваицей – не получается направить свои силы  на достижение приоритетных целей и задач, важные дела постоянно откладываются «на завтра», многое из того что задумывается в итоге не реализуется и остается на уровне идей',
    img: iconLaziness
  },
  {
    title: 'Панические атаки',
    text: 'Внезапно возникающий страх за свою жизнь и здоровье, сопровождающийся повышением частоты сердечных сокращений, одышкой, онемением, тошнотой и другими ощущениями в собственном теле',
    img: iconPanic
  },
  {
    title: 'Тревожно-фобические состояния',
    text: 'Постоянная тревожность и напряжение без объективных, конкретных причин для переживания или же часто возникающий страх перед конкретными ситуациями или людьми',
    img: iconPhobia
  },
  {
    title: 'Зависимости',
    text: 'Эмоциональная зависимость от другого человека. Сильное и регулярно повторяющееся желание еды, алкоголя, интернет-игр и т.д. Отсутствие или временная недоступность желаемого приводит к болезненному переживанию негативных эмоций',
    img: iconDependencies
  },
  {
    title: 'Самооценка и идентификация',
    text: 'Неуверенность в собственных силах и  возможностях, сложности с определением своих сильных и слабых качеств, поиск себя и своего места, боязнь оценки и критики окружающих, отсутствие ясного видения того, как лучше вести себя в той или иной ситуации',
    img: iconSelfEsteem
  },
  {
    title: 'Переживание горя утраты',
    text: 'Причинами могут быть смерть близкого человека, угрожающее жизни заболевание, развод с любимым человеком, потеря имущества, работы и статуса. В следствие этих причин возникает ощущение нереальности случившегося и всего что происходит в данный момент, сильная и непрекращающаяся душевная боль, проблемы с аппетитом, бессонница, ощущение собственной беззащитности',
    img: iconGrief
  },
  {
    title: 'Психосоматические заболевания',
    text: 'Частыми причинами возникновения телесных (соматических) заболеваний являются подавленные негативные эмоции. К заболеваниям, причинами которых могли быть негативные переживания, относят: мигрени, гипертонию, тахикардию, частые простудные заболевания, вегетососудистую дистонию т.д.',
    img: iconDesease
  },
  {
    title: 'Потеря контроля над ситуацией',
    text: 'Происходящие вокруг события кажутся неопределенными и непредсказуемыми, что приводит к суетливости в действиях и постоянному прокручиванию в голове любых вероятных (и невероятных) неприятностей в будущем',
    img: iconLossControl
  },
  {
    title: 'Ощущение бессмысленности',
    text: 'Опустошенность, отсутствие ответа на вопросы зачем и ради чего? Отсутствие четких жизненных ориентиров и целей, дающих понимание куда двигаться дальше',
    img: iconSenselessness
  },
  {
    title: 'Ограничения самореализации',
    text: 'Неумение ставить цели, невыполнение поставленных перед собой задач, сомнения, затрудняющие осуществление выбора и принятие решений, ощущение собственной беспомощности и восприятие сложившейся ситуации как безвыходной',
    img: iconSelfRealization
  }
];
